[
  {
    "role": "Front-end engineer",
    "description": [
      "Maintenance and evolution of legacy systems."
    ]
  },
  {
    "role": "Front-end engineer",
    "description2": "Interactive Kiosks are integrated into the products incorporating the \"e-commerce\" experience by displaying more detailed online information in addition to displaying purchase suggestions.",
    "description": [
      "Backoffice maintenance and evolution for data management and interactive kiosks devices."
    ]
  },
  {
    "role": "Full Stack Engineer",
    "description": [
      "Incorporation of best practices such as code review and testing.",
      "Platform refactoring to ensure visual consistency.",
      "Architectural tweaks to optimize platform performance and quality."
    ]
  },
  {
    "role": "Front-end engineer",
    "description": [
      "Creation and implementation of the best solutions to assist the business always aiming at quality,  user experience and sharing the best practices.",
      "Made collaborative contributions to the Design System <a href=\"https://github.com/juntossomosmais/venice\" target=\"_blank\" rel=\"noopener noreferrer\">library</a>."
    ]
  },
  {
    "role": "Front-end engineer",
    "description": [
      "Development focused on continuous delivery (CI/CD) on one of the Service Platforms (ADA) used by the attendants in assisting customers with a better user experience",
      "Made collaborative development of Pagseguro's library of visual components."
    ]
  },
  {
    "role": "Web Developer Analyst",
    "description": [
      "Development of SPA systems with Angular / Vue for customers from abroad."
    ]
  },
  {
    "role": "Web Developer / GIS Analyst",
    "description": [
      "Development of Web GIS (Geographic Information System) solutions integrated with data visualization tools such as PowerBI and making systems customizations to better adapt the visual identity according to the business necessities providing a better user experience."
    ]
  },
  {
    "role": "Internship / Trainee WebGIS"
  }
]
